do local _ = {
  Bot_id = 440713250,
  Bot_idapi = 960739468,
  RedisIndex = "1",
  SUDO = 262439903,
  UsernameApi = "@helperkjhbot",
  UsernameCli = "@mahdi_RWX",
  admins = {
    {
      262439903,
      "@Nimaaadsh"
    }
  },
  bot_token = "1218884455:AAFYaxXz5XrwttNnNIu8ml1eXoI-mCM5xXI",
  channel_inline = "ciinama",
  channel_username = "@ciinama",
  gp_sudo = 657415607,
  link_poshtibani = "http://t.me/sd",
  linkpardakht = "http://payping.ir/mahdiroo",
  sudo_username = "@raoof1379",
  sudo_users = {
    262439903,
    767392925,
    602016339
  },
  sudoinline_username = "Code_NoOb",
  userpasswd = "matador",
  helpmod = [[
⇢ برای تنظیم کردن فرد به عنوان مدیر ربات :
✵ `مدیر` [یوزرنیم | ایدی | ریپلای]
↛ `promote` [username | id | reply]
★☆ این دستور برای تنظیم کردن شخصی به عنوان مدیر ربات در گروه میباشد.

⇢ برای حذف کردن فرد از عنوان مدیر ربات :
✵ `حذف مدیر` [یوزرنیم | ایدی | ریپلای]
↛ `demote` [username | id | reply]
★☆ این دستور برای حذف کردن شخصی از عنوان مدیر ربات در گروه میباشد.

⇢ برای سکوت کردن فرد توسط ربات :
✵ `سکوت` [یوزرنیم | ایدی | ریپلای]
↛ `mute` [username| id| reply]
★☆ این دستور برای بیصدا کردن شخص در گروه میباشد.

⇢ برای سکوت کردن فرد *(ثانیه)* توسط ربات :
✵ `سکوت` _(عدد)_ *[ثانیه]*
↛ `mute` (num) *[s]*
★☆ این دستور برای بیصدا کردن *(ثانیه)* شخص در گروه میباشد.

⇢ برای سکوت کردن فرد *(دقیقه)* توسط ربات :
✵ `سکوت` _(عدد)_ *[دقیقه]*
↛ `mute` (num) *[m]*
★☆ این دستور برای بیصدا کردن *(دقیقه)* شخص در گروه میباشد.

⇢ برای سکوت کردن فرد *(ساعت)* توسط ربات :
✵ `سکوت` _(عدد)_ *[ساعت]*
↛ `mute` (num) *[h]*
★☆ این دستور برای بیصدا کردن *(ساعت)* شخص در گروه میباشد.

⇢ برای حذف سکوت کردن فرد توسط ربات :
✵ `حذف سکوت` [یوزرنیم | ایدی | ریپلای]
↛ `unmute` [username| id| reply]
★☆ این دستور برای باصدا کردن شخص در گروه میباشد.

⇢ برای اخراج کردن فرد توسط ربات :
✵ `اخراج` [یوزرنیم | ایدی | ریپلای]
↛ `kick` [username| id| reply]
★☆ این دستور برای اخراج کردن فرد از گروه میباشد.

⇢ برای مسدود کردن فرد توسط ربات :
✵ `مسدود` [یوزرنیم | ایدی | ریپلای]
↛ `ban` [username| id| reply]
★☆ این دستور برای مسدود کردن فرد از گروه میباشد.

⇢ برای رفع مسدود کردن فرد توسط ربات :
✵ `حذف مسدود` [یوزرنیم | ایدی | ریپلای]
↛ `unban` [username| id| reply]
★☆ این دستور برای رفع مسدود کردن فرد از گروه میباشد.

⇢ برای اخطار دادن به فرد توسط ربات :
✵ `اخطار` [یوزرنیم | ایدی | ریپلای]
↛ `warn` [username| id| reply]
★☆ این دستور برای اخطار دادن به فرد در گروه میباشد.

⇢ برای حذف کردن اخطار فرد توسط ربات :
✵ `حذف اخطار` [یوزرنیم | ایدی | ریپلای]
↛ `unwarn` [username| id| reply]
★☆ این دستور برای حذف کردن اخطار فرد در گروه میباشد.

⇢ برای افزودن یا خذف افراد از لیست سفید :
✵ `لیست سفید` [+-] [یوزرنیم | ایدی |ریپلی] 
↛ `whitelist` [+-] [username | id |reply] 
★☆ این دستور برای اضافه کردن یا حذف کردن شخص از لیست سفید ربات میباشد.

⇢ برای ممنوع کردن کلمه ای در گروه :
✵ `فیلتر` [کلمه]
↛ `filter` [word]
★☆ این دستور برای ممنوع کردن کلمه ها در گروه میباشد.

⇢ برای آزاد کردن کلمه ای در گروه :
✵ `حذف فیلتر` [کلمه]
↛ `unfilter` [word]
★☆ این دستور برای آزاد کردن کلمه ها در گروه میباشد.
  ]],
  helpmod_b = [[
  ⇢ برای قفل کردن گروه *(زمانی)* توسط ربات :
✵ `قفل گروه` _[ساعت] [دقیقه] [ثانیه]_
↛ `lockgp` _[h] [m] [s]_
★☆ این دستور برای قفل کردن *(زمانی)* گروه میباشد.

⇢ برای قفل کردن گروه *(ثانیه)* توسط ربات :
✵ `قفل گروه` _[عدد] [ثانیه]_
↛ `lockgp` _[num] [s]_
★☆ این دستور برای قفل کردن *(ثانیه)* گروه میباشد.

⇢ برای قفل کردن گروه *(دقیقه)* توسط ربات :
✵ `قفل گروه` _[عدد] [دقیقه]_
↛ `lockgp` _[num] [m]_
★☆ این دستور برای قفل کردن *(دقیقه)* گروه میباشد.

⇢ برای قفل کردن گروه *(ساعت)* توسط ربات :
✵ `قفل گروه` _[عدد] [ساعت]_
↛ `lockgp` _[num] [h]_
★☆ این دستور برای قفل کردن *(ساعت)* گروه میباشد.

⇢ برای نمایش اطلاعات کاربری شخص :
✵ `کاربری` [یوزرنیم]
↛ `res` [username]
★☆ این دستور برای نمایش دادن اطلاعات کاربری شخص توسط ربات میباشد.

⇢ برای نمایش اطلاعات کاربری شخص :
✵ `شناسه` [ایدی]
↛ `whois` [id]
★☆ این دستور برای نمایش دادن اطلاعات کاربری شخص توسط ربات میباشد.

⇢ برای سنجاق کردن متن در گروه توسط ربات :
✵ `سنجاق` [ریپلای]
↛ `pin` [reply]
★☆ این دستور برای سنجاق کردن متن در گروه توسط ربات میباشد.

⇢ برای حذف ینجاق کردن متن در گروه توسط ربات :
✵ `حذف سنجاق`
↛ `unpin`
★☆ این دستور برای حذف کردن پیام سنجاق شده در گروه میباشد.

⇢ برای فعال و غیرفعال کردن خوشآمد ربات :
✵ `خوشآمد [فعال] [غیرفعال]`
↛ `welcome [enable] [disable]`
★☆ این دستور برای فعال و غیرفعال کردن حالت خوشآمدگوی ربات میباشد.

⇢ برای نمایش تنظیمات اعمال شده در گروه :
✵ `تنظیمات`
↛ `settings`
★☆ این دستور برای نمایش دادن تنظیمات اعمال شده ربات در گروه میباشد.

⇢ برای نمایش قوانین گروه :
✵ `قوانین`
↛ `rules`
★☆ این دستور برای نمایش قوانین ثبت شده در ربات میباشد.

⇢ برای نمایش درباره گروه :
✵ `درباره`
↛ `about`
★☆ این دستور برای نمایش درباره ثبت شده در ربات میباشد.

⇢ برای ساخت لینک جدید توسط ربات :
✵ `لینک جدید`
↛ `newlink`
★☆ این دستور برای ساخت لینک جدید گروه توسط ربات میباشد.

⇢ برای نمایش لینک گروه :
✵ `لینک`
↛ `link`
★☆ این دستور برای نمایش لینک ثبت شده در ربات میباشد.

⇢ برای ارسال لینک گروه به خصوصی شما :
✵ `لینک خصوصی`
↛ `linkpv`
★☆ این دستور برای ارسال لینک ثبت شده در ربات به خصوصی شما میباشد.

⇢ برای فعال و غیر فعال کردن پاکسازی خودکار :
✵ `پاکسازی ربات` *[فعال / غیرفعال]*
↛ `delbot` *[on / off]*
★☆ این دستور برای فعال و غیر فعال کردن پاکسازی خودکار در گروه میباشد.
  ]],
  helpmod_c = [[
  ⇢ برای نمایش افراد اخطار گرفته های گروه :
✵ `لیست اخطار`
↛ `warns`
★☆ این دستور برای نمایش دادن افراد اخطار گرفته توسط ربات در گروه میباشد.

⇢ برای نمایش کلمات ممنوع شده گروه :
✵ `لیست فیلتر`
↛ `filterlist`
★☆ این دستور برای نمایش دادن کلمات ممنوع شده توسط ربات گروه میباشد.

⇢ برای نمایش افراد مسدود شده گروه :
✵ `لیست مسدود`
↛ `banlist`
★☆ این دستور برای نمایش دادن افراد مسدود شده توسط ربات گروه میباشد.

⇢ برای نمایش مالکین گروه :
✵ `لیست مالکان`
↛ `ownerlist`
★☆ این دستور برای نمایش دادن مالکین ربات در گروه میباشد.

⇢ برای نمایش مدیران گروه :
✵ `لیست مدیران`
↛ `modlist`
★☆ این دستور برای نمایش دادن مدیران ربات در گروه میباشد.

⇢ برای نمایش افراد سفید شده گروه :
✵ `لیست سفیذ`
↛ `viplist`
★☆ این دستور برای نمایش دادن افراد سفید شده توسط ربات گروه میباشد.

⇢ برای نمایش سکوت شده های گروه :
✵ `لیست سکوت`
↛ `mutetlist`
★☆ این دستور برای نمایش دادن افراد بیصدا شده توسط ربات در گروه میباشد.
  ]],
  helpset = [[
⇢ برای تنظیم کردن قوانین ربات:
✵ `تنظیم قوانین` [متن]
↛ `setrules` [text]
★☆ این دستور برای تنظبم کردن قوانین گروه در ربات میباشد.

⇢ برای تنظیم کردن نام گروه توسط ربات:
✵ `تنظیم اسم` [متن]
↛ `setname` [text]
★☆ این دستور برای تنظبم کردن گروه میباشد.

⇢ برای تنظیم کردن لینک گروه در ربات:
✵ `تنظیم لینک` [لینک]
↛ `setlink` [link]
★☆ این دستور برای تنظبم کردن لینک گروه در ربات میباشد.

⇢ برای تنظیم کردن درباره گروه:
✵ `تنظیم درباره` [متن]
↛ `setabout` [text]
★☆ این دستور برای تنظبم کردن درباره گروه توسط ربات میباشد.

⇢ برای تنظیم کردن متن خوشآمد گروه:
✵ `تنظیم خوشآمد` [متن]
↛ `setwelcome` [text]
★☆ این دستور برای تنظبم کردن متن خوشآمد گروه در ربات میباشد.

⇢ برای تنظیم کردن حداکثر اخطار های ربات:
✵ `حداکثر اخطار` [1-20]
↛ `setwarn` [1-20]
★☆ این دستور برای تنظیم کردن حداکثر اخطار ربات در گروه میباشد.

⇢ برای تنظیم کردن زمان ارسال پیام مکرر توسط ربات:
✵ `تنظیم زمان بررسی` [1-10]
↛ `setfloodtime` [1-10]
★☆ این دستور برای تنظیم کردن زمان بین هر پیام مکرر در گروه میباشد.

⇢ برای تنظیم کردن حداکثر حروف ارسالی توسط ربات:
✵ `حداکثر حروف مجاز` [عدد]
↛ `setchar` [Number]
★☆ این دستور برای تنظیم کردن تعداد مجاز کارکتر ارسالی در گروه میباشد.

⇢ برای تنظیم کردن حداکثر پیام مکرر توسط ربات:
✵ `تنظیم پیام مکرر` [1-50]
↛ `!setflood` [1-50]
★☆ این دستور برای تنظیم کردن تعداد مجاز پیام مکرر ارسالی در گروه میباشد.

⇢ برای تنظیم کردن حداکثر زمان سکوت ربات:
✵ `تنظیم سکوت` *[1-300]*
↛ `!setmute` *[1-300]*
★☆ این دستور برای تنظیم کردن حداکثر زمان سکوت در گروه میباشد.

⇢ برای تنظیم کردن حداکثر زمان پاکسازی ربات:
✵ `زمان پاکسازی ربات` *[60-300]*
↛ `!deltimebot` *[60-300]*
★☆ این دستور برای تنظیم کردن حداکثر زمان پاکسازی در گروه میباشد.

⇢ برای تنظیم حالت پیام مکرر:
✵ `پیام مکرر` *[اخراج / سکوت]*
↛ `!flood` *[kick / mute]*
★☆ این دستور برای تنظیم حالت پیام مکرر در گروه میباشد.
  ]],
 helpclean = [[
⇢ برای پاک کردن لیست بن شده ها توسط ربات :
✵ `پاک کردن لیست مسدود`
↛ `clean bans`
★☆ این دستور برای رفع بن کردن تمام کاربران بن شده در گروه میباشد.

⇢ برای پاک کردن لیست اخطارها ها توسط ربات :
✵ `پاک کردن اخطار ها`
↛ `clean warns`
★☆ این دستور برای پاک کردن کردن تمام اخطار تمام کاربران گروه میباشد.

⇢ برای پاک کردن لیست سکوت شده ها توسط ربات :
✵ `پاک کردن لیست سکوت`
↛ `clean silentlist`
★☆ این دستور برای رفع سکوت کردن تمام کاربران سکوت شده در گروه میباشد.

⇢ برای پاک کردن کلمات فیلتر شده توسط ربات :
✵ `پاک کردن لیست فیلتر`
↛ `clean filterlist`
★☆ این دستور برای پاک کردن تمام کلمات ممنوع شده در گروه میباشد.

⇢ برای پاک کردن ربات ها توسط ربات :
✵ `پاک کردن ربات ها`
↛ `clean bots`
★☆ این دستور برای پاک کردن تمام ربات های مخرب در گروه میباشد.

⇢ برای پاک کردن لیست سیاه توسط ربات :
✵ `پاک کردن لیست سیاه`
↛ `clean blacklist`
★☆ این دستور برای پاک کردن لیست سیاه گروه میباشد.

⇢ برای پاک کردن لیست دیلت اکانتی ها توسط ربات :
✵ `پاک کردن اکانت های دلیت شده`
↛ `clean deleted`
★☆ این دستور برای پاک کردن لیست دیلت اکانتی ها گروه میباشد.

⇢ برای پاک کردن لیست مدیرهای ربات :
✵ `پاک کردن مدیران`
↛ `clean mods`
★☆ این دستور برای پاک کردن لیست مدیرهای ربات در گروه میباشد.

⇢ برای پاک کردن قوانین ثبت شده در ربات :
✵ `پاک کردن قوانین`
↛ `clean rules`
★☆ این دستور برای پاک قوانین ثبت شده در ربات برای گروه میباشد.

⇢ برای پاک کردن درباره ثبت شده در ربات :
✵ `پاک کردن درباره`
↛ `clean about`
★☆ این دستور برای پاک درباره ثبت شده در ربات برای گروه میباشد.
]],
helpclean_b = [[
⇢ برای پاک کردن تمام پیام های گروه توسط ربات :
✵ `پاک کردن پیام ها`
↛ `clean msgs`
★☆ این دستور برای پاکسازی تمام پیام های گروه میباشد.

⇢ برای پاک کردن تعدادی از پیام ها توسط ربات :
✵ `پاکسازی` [1-100]
↛ `rmsg` [1-100]
★☆ این دستور برای پاکسازی تعداد تعیین شده پیام های گروه میباشد.

⇢ برای پاک کردن پیام های خود شخص توسط ربات :
✵ `پاکسازی پیام های من`
↛ `mydel`
★☆ این دستور برای پاکسازی تمام پیام های شخص در گروه میباشد.

⇢ برای پاک کردن تمام پیام های یک شخص توسط ربات :
✵ `حذف پیام` [ریپلای]
↛ `delall` [replay]
★☆ این دستور برای پاکسازی تمام پیام های شخص انتخاب شده در گروه میباشد.

⇢ برای پاک یک پیام توسط ربات :
✵ `حذف` [ریپلای]
↛ `del` [replay]
★☆ این دستور برای پاکسازی پیام انتخاب شده در گروه میباشد.
]], 
}
return _
end